# Indexing

In [39]:
import pandas as pd

In [40]:
people={
    "first":['jon','cersei','arya'],
    "last":["snow","lannister",'stark'],
    "place":['winterfell','kings landing','bravos']
}

In [41]:
df=pd.DataFrame(people)

In [42]:
df.columns

Index(['first', 'last', 'place'], dtype='object')

In [43]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [44]:
df.set_index('last')

            first          place
last
snow          jon     winterfell
lannister  cersei  kings landing
stark        arya         bravos

In [45]:
df

    first       last          place
0     jon       snow     winterfell
1  cersei  lannister  kings landing
2    arya      stark         bravos

In [46]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [47]:
df.set_index('last',inplace=True)

In [48]:
df.index

Index(['snow', 'lannister', 'stark'], dtype='object', name='last')

In [49]:
df.sort_index()

            first          place
last
lannister  cersei  kings landing
snow          jon     winterfell
stark        arya         bravos


# Filtering Data

In [50]:
office={
       "first": ["Michael", "Jim", "Pam", "Dwight", "Ryan",
              "Stanley", "Kevin", "Angela", "Kelly", "Creed"],
    "last": ["Scott", "Halpert", "Beesly", "Schrute", "Howard",
             "Hudson", "Malone", "Martin", "Kapoor", "Bratton"],
    "email": [
        "michael.scott@dundermifflin.com",
        "jim.halpert@dundermifflin.com",
        "pam.beesly@dundermifflin.com",
        "dwight.schrute@dundermifflin.com",
        "ryan.howard@dundermifflin.com",
        "stanley.hudson@dundermifflin.com",
        "kevin.malone@dundermifflin.com",
        "angela.martin@dundermifflin.com",
        "kelly.kapoor@dundermifflin.com",
        "creed.bratton@dundermifflin.com"
    ],
    "phone": [
        "555-123-4567", "555-234-5678", "555-345-6789", "555-456-7890", 
        "555-567-8901", "555-678-9012", "555-789-0123", "555-890-1234", 
        "555-901-2345", "555-012-3456"
    ],
    "salary": [
        75000, 65000, 45000, 60000, 55000,
        70000, 40000, 48000, 50000, 38000
    ],
    "area": [
        "Scranton", "Pensilvenya", "Paris", "Schrute Farms", "New York",
        "Electricity", "Scranton", "Scranton", "Scranton", "Unknown"
    ]
}

In [51]:
dmf=pd.DataFrame(office)

In [52]:
dmf

,first,last,email,phone,salary,area
0,Michael,Scott,michael.scott@dundermifflin.com,555-123-4567,75000,Scranton
1,Jim,Halpert,jim.halpert@dundermifflin.com,555-234-5678,65000,Pensilvenya
2,Pam,Beesly,pam.beesly@dundermifflin.com,555-345-6789,45000,Paris
3,Dwight,Schrute,dwight.schrute@dundermifflin.com,555-456-7890,60000,Schrute Farms
4,Ryan,Howard,ryan.howard@dundermifflin.com,555-567-8901,55000,New York
5,Stanley,Hudson,stanley.hudson@dundermifflin.com,555-678-9012,70000,Electricity
6,Kevin,Malone,kevin.malone@dundermifflin.com,555-789-0123,40000,Scranton
7,Angela,Martin,angela.martin@dundermifflin.com,555-890-1234,48000,Scranton
8,Kelly,Kapoor,kelly.kapoor@dundermifflin.com,555-901-2345,50000,Scranton
9,Creed,Bratton,creed.bratton@dundermifflin.com,555-012-3456,38000,Unknown

In [53]:
thgf=(dmf['last']=='Scott')

In [54]:
dmf[thgf]

,first,last,email,phone,salary,area
0,Michael,Scott,michael.scott@dundermifflin.com,555-123-4567,75000,Scranton

In [55]:
#above two cells can also be executed like this
dmf[dmf['last']=='Scott']

,first,last,email,phone,salary,area
0,Michael,Scott,michael.scott@dundermifflin.com,555-123-4567,75000,Scranton

In [56]:
#or like this with .loc we can aslo access speific column
dmf.loc[thgf]

,first,last,email,phone,salary,area
0,Michael,Scott,michael.scott@dundermifflin.com,555-123-4567,75000,Scranton

In [57]:
dmf.loc[thgf,'email']

0    michael.scott@dundermifflin.com
Name: email, dtype: object

In [58]:
flit=dmf['salary']>50000

In [59]:
dmf[flit]

,first,last,email,phone,salary,area
0,Michael,Scott,michael.scott@dundermifflin.com,555-123-4567,75000,Scranton
1,Jim,Halpert,jim.halpert@dundermifflin.com,555-234-5678,65000,Pensilvenya
3,Dwight,Schrute,dwight.schrute@dundermifflin.com,555-456-7890,60000,Schrute Farms
4,Ryan,Howard,ryan.howard@dundermifflin.com,555-567-8901,55000,New York
5,Stanley,Hudson,stanley.hudson@dundermifflin.com,555-678-9012,70000,Electricity

In [60]:
dmf.loc[flit,'area']

0         Scranton
1      Pensilvenya
3    Schrute Farms
4         New York
5      Electricity
Name: area, dtype: object

In [61]:
areas=['Scranton','New York']

In [64]:
arr=dmf['area'].isin(areas)

In [67]:
dmf.loc[arr,'first']

0    Michael
4       Ryan
6      Kevin
7     Angela
8      Kelly
Name: first, dtype: object

In [ ]:
# strf=dmf['column_name'].str.contains('Data_value',na=False)

# another type of filter uses string method to check conditionals